app/Http/Controllers/Auth/LoginController.php

select * from `financial_years` where `start_date` <= '2025-02-18' and `end_date` >= '2025-02-18' and `status` = 1 limit 1
---
    public function authenticated()
    {
        if (Auth::user()->user_type == 'admin' || Auth::user()->user_type == 'staff') {

            // Get the active financial year for today's date
            $financial_year = FinancialYear::where('start_date', '<=', date("Y-m-d"))
                ->where('end_date', '>=', date("Y-m-d"))
                ->where("status", 1)
                ->first();