app/Http/Helpers.php

select * from `business_settings` where `type` = 'vendor_system_activation' limit 1
---
    function filter_products($products)
    {
        $verified_sellers = verified_sellers_id();
        if (BusinessSetting::where('type', 'vendor_system_activation')->first()->value == 1) {

select * from `business_settings` where `type` = 'system_default_currency' limit 1
select * from `currencies` where `currencies`.`id` = '27' limit 1
select * from `currencies` where `code` = 'BDT' limit 1
---
    function convert_price($price)
    {
        $business_settings = BusinessSetting::where('type', 'system_default_currency')->first();
        if ($business_settings != null) {
            $currency = Currency::find($business_settings->value);
            $price = floatval($price) / floatval($currency->exchange_rate);
        }

        $code = \App\Models\Currency::findOrFail(\App\Models\BusinessSetting::where('type', 'system_default_currency')->first()->value)->code;
        if (Session::has('currency_code')) {
            $currency = Currency::where('code', Session::get('currency_code', $code))->first();
        } else {
            $currency = Currency::where('code', $code)->first();

select * from `business_settings` where `type` = 'no_of_decimals' limit 1
select * from `business_settings` where `type` = 'symbol_format' limit 1
---
    function format_price($price)
    {
        if (BusinessSetting::where('type', 'decimal_separator')->first()->value == 1) {
            $fomated_price = number_format($price, BusinessSetting::where('type', 'no_of_decimals')->first()->value);
        } else {
            $fomated_price = number_format($price, BusinessSetting::where('type', 'no_of_decimals')->first()->value, ',', ' ');
        }

        if (BusinessSetting::where('type', 'symbol_format')->first()->value == 1) {

select * from `products` where `products`.`id` = 5068 limit 1
---
    function main_home_base_price($id)
    {
        $product = Product::findOrFail($id);

select * from `products` where `products`.`id` = 5068 limit 1
---
    function main_home_discounted_base_price($id)
    {
        $product = Product::findOrFail($id);

select * from `business_settings` where `type` = 'system_default_currency' limit 1
select * from `currencies` where `code` = 'BDT' limit 1
---
    function currency_symbol()
    {
        $code = \App\Models\Currency::findOrFail(\App\Models\BusinessSetting::where('type', 'system_default_currency')->first()->value)->code;
        if (Session::has('currency_code')) {
            $currency = Currency::where('code', Session::get('currency_code', $code))->first();
        } else {
            $currency = Currency::where('code', $code)->first();

select * from `translations` where `lang` = 'en' and `lang_key` = 'Featured Products' limit 1
select * from `translations` where `lang_key` = 'Featured Products' and `lang` = 'en' limit 1
---
function translate($key, $lang = null)
{
    if ($lang == null) {
        $lang = App::getLocale();
    }

    $translation_def = Translation::where('lang', env('DEFAULT_LANGUAGE', 'en'))->where('lang_key', $key)->first();
    if ($translation_def == null) {
        $translation_def = new Translation;
        $translation_def->lang = env('DEFAULT_LANGUAGE', 'en');
        $translation_def->lang_key = $key;
        $translation_def->lang_value = $key;
        $translation_def->save();
    }

    //Check for session lang
    $translation_locale = Translation::where('lang_key', $key)->where('lang', $lang)->first();

select * from `uploads` where `uploads`.`id` = '9035' and `uploads`.`deleted_at` is null limit 1
---
    function uploaded_asset($id)
    {
        if (($asset = \App\Models\Upload::find($id)) != null) {

select * from `business_settings` where `type` = 'site_icon' limit 1
---
    function get_setting($key, $default = null)
    {
        $setting = BusinessSetting::where('type', $key)->first();

select * from `financial_years` where `id` = 7 order by `end_date` desc limit 1
select * from `financial_years` order by `end_date` desc
---
    function get_financial_years($id = null)
    {
        $query = FinancialYear::orderBy('end_date', 'desc');

        if ($id !== null) {
            return $query->where('id', $id)->first();
        } else {
            return $query->get();