app/Http/Controllers/LanguageController.php

    public function changeLanguage(Request $request)
    {
    	$request->session()->put('locale', $request->locale);
        $language = Language::where('code', $request->locale)->first();
---
select * from `languages` where `code` = 'bd' limit 1