app/Http/Controllers/PageController.php

select * from `pages` where `slug` = 'play.png' limit 1
---
    public function show_custom_page($slug){
        $page = Page::where('slug', $slug)->first();