app/Http/Controllers/Accounts/IncomeStatementController.php

select * from `financial_years` order by `end_date` desc
---
    public function index()
    {
        $fyears = FinancialYear::orderBy('end_date', 'desc')->get();

select `costs_of_good_solds` from `acc_predefine_accounts` limit 1
---
    public function report(Request $request)
    {
        $warehouse_id   = $request->warehouse_id ? $request->warehouse_id : null;
        $fyear          = $request->input('fyear') ? $request->input('fyear') : Session::get('fyear');
        $type           = $request->type;

        $predefined = AccPredefineAccount::select('costs_of_good_solds')->first();

select `costs_of_good_solds` from `acc_predefine_accounts` limit 1
---
    public function yearly_report(Request $request)
    {
        $warehouse_id   = $request->warehouse_id ? $request->warehouse_id : null;
        $fyear          = $request->input('fyear') ? $request->input('fyear') : Session::get('fyear');
        $type           = $request->type;

        $financial_years = FinancialYear::where('id', '<=', $fyear)->orderBy('id', 'desc')->limit(3)->get();

        $predefined = AccPredefineAccount::select('costs_of_good_solds')->first();